# ContinuousrailExtensionLengthParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ContinuousrailExtensionLengthParam Property
ParameterTypeId Class See Also
---
"Length"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ContinuousrailExtensionLengthParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContinuousrailExtensionLengthParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ContinuousrailExtensionLengthParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace